** Ejercicio

1. Simulación de particiones fijas:

   -En c
   -Escribe un programa que simule un sistema de administración de memoria con particiones fijas
   -Debe permitir al usuario definir el tamaño total de la memoria y las particiones
   -Simula la asignación y liberación de procesos a las particiones, mostrando cómo se utiliza la memoria
   -Esto hacerlo con areglos

ejemplo de los nodos:
nodo a[100];

#+BEGIN_SRC C
  #include <stdio.h>

  //Definimos el tipo nodo con el struct
  typedef struct {
   int inicio;
   int fin;
    } nodo;
  
  int main(){
    int espacioMemoria, particiones;
    nodo arr[1000]; //Asignación estatica

      //Espacio en memoria 
      printf("Dime cuanto vas a ocupar de memoria: ");
      scanf("%d",  &espacioMemoria);

      //Particiones
      printf("Dime cuanto particiones: ");
      scanf("%d", &particiones);


     printf("memoria: %d , Particiones: %d", espacioMemoria, particiones);
       return 0;
      }
#+END_SRC


#+RESULTS:
| Dime cuanto vas a ocupar de memoria: Dime cuanto particiones: memoria: 0 | Particiones: 0 |
